# parameters
nc: 1  # number of classes
nkpt: 17
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
dw_conv_kpt: True

# anchors
anchors:
  - [ 19,27,  44,40,  38,94 ]  # P3/8
  - [ 96,68,  86,152,  180,137 ]  # P4/16
  - [ 140,301,  303,264,  238,542 ]  # P5/32
  - [ 436,615,  739,380,  925,792 ]  # P6/64

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ReOrg, []],  # 0
   [-1, 1, Conv, [64, 3, 1]],  # 1-P1/2
   
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   #[-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   #[-1, 1, Conv, [64, 3, 1]],
   #[-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 7
         
   [-1, 1, Conv, [256, 3, 2]],  # 8-P3/8
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   #[-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   #[-1, 1, Conv, [128, 3, 1]],
   #[-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 13
         
   [-1, 1, Conv, [512, 3, 2]],  # 14-P4/16
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   #[-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   #[-1, 1, Conv, [256, 3, 1]],
   #[-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 19
         
   [-1, 1, Conv, [768, 3, 2]],  # 20-P5/32
   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   #[-1, 1, Conv, [384, 3, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   #[-1, 1, Conv, [384, 3, 1]],
   #[-1, 1, Conv, [384, 3, 1]],
   [[-1, -2, -3], 1, Concat, [1]],
   [-1, 1, Conv, [768, 1, 1]],  # 25
         
   [-1, 1, Conv, [1024, 3, 2]],  # 26-P6/64
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   #[-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   #[-1, 1, Conv, [512, 3, 1]],
   #[-1, 1, Conv, [512, 3, 1]],
   [[-1, -2, -3], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]], # 31
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 32
  
   [-1, 1, Conv, [384, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [25, 1, Conv, [384, 1, 1]], # route backbone P5
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [384, 1, 1]], # 44
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [19, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 56
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [13, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 68
      
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 56], 1, Concat, [1]],  # cat
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 78
      
   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 44], 1, Concat, [1]],  # cat
   
   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [384, 1, 1]], # 88
      
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 32], 1, Concat, [1]],  # cat
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 98
   
   [68, 1, Conv, [256, 3, 1]],
   [78, 1, Conv, [512, 3, 1]],
   [88, 1, Conv, [768, 3, 1]],
   [98, 1, Conv, [1024, 3, 1]],

   [[99,100,101,102], 1, IKeypoint, [nc, anchors, nkpt]],   # Detect(P3, P4, P5, P6)
  ]
